public class Main {
    public static void main(String[] args) {
        int price = 3400;
        int miles = 20; // за каждые 20 рублей начисляется 1 миля
        int bonus = price / miles;
        System.out.println(bonus);

        // Объявляете переменные для входных данных и
        // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной мили

        // Рассчитываете количество бонусных миль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран
    }
}